function pokeFacts (){
  var facts = ["Ανάποδα το όνομα ekans γράφεται 'snake' που σημαίνει φίδι και η εξέλιξη του, το arbok, ανάποδα διαβάζεται'Kobra'(κόμπρα)", 
  "Το όνομα του Mareep είναι αναγραμματισμός της λέξης Ampere (αμπέρ), που είναι μονάδα μέτρησης της έντασης του ηλεκτρικού ρεύματος", 
  "Το Missingno απο προγραμματιστικής άποψης είναι μια κενή θέση στο pokedex, ακριβώς λόγω αυτού με μια ειδική διαδικασία μπορεί να γίνει όποιο pokemon ήθελε ο χρήστης.",
  "Το Rhydon είναι το πρώτο pokemon που δημιουργήθηκε και καταχωρήθηκε στο pokedex",
  "Τα pokemon τύπου psychic είναι αδύναμα απέναντη σε επίθέσεις Dark(σκοτάδι), ghost(φαντάσματα) και bug(έντομο) γιατί αυτές είναι οι πιο κοινές φοβίες που συναντάς στον άνθρωπο",
  "Αν υπήρχε θεωρητικά ένα pokemon με όλους τους τύπους μαζί, η μοναδική του αδυναμία θα ήταν η πέτρα (rock)",
  "Το Xatu μπορεί να βλέπει μαζί το μέλλον και το παρελθόν, γι' αυτόν και μένει συνέχεια σιωπηλό, επειδή βλέπει όλα τα τρομερά πράγματα που μπορεί να συμβούν αλλα δεν μπορεί να κάνει τίποτα γι' αυτό",
  "To cubone φοράει το κρανίο της νεκρής του μάνας",
  "Όσο το spoink πηδάει τόσο η καρδιά του συνεχίζει να χτυπάει, αν σταματήσει να πηδάει, πεθαίνει.",
  "Το yanmask είναι στην πραγματικότητα ένας νεκρός άνθρωπος και κουβαλάει πάντα μαζί του μια μάσκα. Η μάσκα του έχει το σχήμα του προσώπου του όταν ήταν ζωντανός. Μερικές φορες την κοιτάζει και κλαίει.",
  "Το Hitmonchan και το Hitmonlee έχουν πάρει την ονομασία τους απο τους Jackie Chan και Bruce Lee αντίστοιχα.",
  "Το Arcanine στην αρχή σχεδιάζανε να το έχουνε σαν θρυλικό pokemon, στο pokedex ακόμα χαρακτηρίζεται ως 'θρυλικό' pokemon.",
  "Η μασκότ των pokemon αρχικα σχεδίαζοταν να γίνει το clefairy, και όντως η ιαπωνική σειρά των manga στα pokemon ο πρωταγωνιστής έχει ένα clefairy για pokemon, ωστόσο όταν πήγε να περάσει απο το παιχνίδι στην τηλεόραση, οι δημιουργοί αποφάσισαν ότι το Pikachu θα ήταν καλύτερη επιλογή",
  "Μια θεωρία εικάζει ότι το ditto ήταν μια αποτυχημένη προσπάθεια κλωνοποίησης του mew, γι' αυτό και στις πρώτες κασέτες βρισκόταν σε μέρη που είχαν να κάνουμε με το mew (πx: cinnabar mansion, cerulean cave), επίσης γι' αυτό μόνο το mew και το ditto την μαθαίνουν ανεβαίνοντας επίπεδα και γι' αυτο οι shiny μορφες και των δύο είναι το ίδιο χρώμα (μπλέ).",
  "To Rotom είναι πρακτικά ένα pokemon μοτέρ. Μπαίνει σε διάφορες ηλεκτρονικές συσκευές και τις ελέγχει (πχ: ψυγεία, φούρνους, ανεμιστήρες, πλυντήρια, μηχανή του γκαζόν και pokedex). To όνομα Rotom αν το διαβάσεις ανάποδα είναι Motor (μοτέρ).",
  "Στα παιχνίδια το smeargle μπορει να μάθει σχεδόν όλες τις επιθέσεις του παιχνιδιού με την κίνηση sketch.",
  "Το σώμα του wobbufet είναι στην πραγματικότητα αντιπερισπασμός, το αληθινό του 'σώμα' είναι στην πραγματικότητα η ουρά του (η μαύρη με τα μάτια).",
  "O Καθηγητής oak (εγω δηλαδή) κανονικά σχεδιαζόταν να μπορεί ο παίκτης να τον πολεμήσει στο παιχνίδι και είχε πολύ δυνατά pokemon + το pokemon που ποτέ δεν επέλεξε κανείς, ακυρώθηκε το σχέδιο αυτό τελευτάια στιγμή ωστόσο μπορείς ακόμα να τον πολεμήσεις μέσω glitch.",
  "Στην ιαπωνία με μια ειδική συσκευή σαν καλώδιο η pokemon crystal μπορούσε να επικοινωνεί με το κινητό τηλέφωνο του χρήστη, μέσω του κινητού ο χρήστης μπορούσε να πάρει online διάφορα events όπως Celebi.",
  "Η περιοχή kanto είναι βασισμένη στην ομόνημη πόλη της ιαπωνίας.",
  "Τα ονόματα των θρυλικών πουλιών ArticUNO, ZapDOS και MolTRES κρύβουν μέσα τους τους αριθμούς 'Ένα, δύο τρία' στα Ισπανικά.",
  "H Ruby, Η Sapphire και η Emerald είναι οι μόνες κασέτες στις οποίες είχες πατέρα.",
  "To Ιαπωνικό όνομα του ash(Satoshi)είναι φόρος τιμής στον διευθυντή της game freak, 'Satoshi Tajiri', ενώ το ιαπωνικό όνομα του Gary είναι φόρος τιμής στον δημιουργό του Mario του Zelda και άλλων διάσημων παιχνιδιών, Shigeru Miyamoto ",
  "Καθώς το Paras μεγαλώνει ο μύκτητας στην πλάτη του μεγαλώνει επίσης, όταν εξελίσεται σε parasect το μανιτάρι παίρνει ολόκληροτικα τον έλεγχο του σώματος του Paras και το αληθινό Paras πεθαίνει.",
  "Το 2011 ένα απομονομένο νησί στον Ειρινικό ωκεανό που λέγεται Niue κόβει νομίσματα που έχουν πάνω Pokemon, και μπορεί κανείς να τα ξοδέψει για αληθινά προϊόντα ή υπηρεσίες.",
  "Το μαυρό που στροβιλίζει στην κοιλιά του poliwag++ έχουν παρθεί στην πραγματικότητα από τα άντερα του γυρίνου, που φαίνονται μέσα απο το δέρμα του.",
  "Υπήρχε ένα επισόδειο pokemon το οποίο προβλήθηκε στην ιαπωνία και είχε να κάνει με το porygon, λεγόταν cyber-soldier porygon και προβλήθηκε μόνο μια φορά και μόνο στην ιαπωνία, λέγεται ότι λόγω πολύ έντονων φωτισμών και λάμψεων που γινόντουσαν σε αυτό το επισόδειο πολυ ευαίσθητα σε τέτοιου είδους θέματα παιδιά έπαθαν επιληψία.",
  "To nosepass οταν το συναντάς στον χάρτη του Pokemon-go κοιτάει πάντα στον βορρά",
  ];
  var fact = Math.floor(Math.random() * facts.length);
  return { "fact": fact,"facts": facts}
} 

module.exports = {pokeFacts}